if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "isen-ng/dotnet-sdk-versions" # For dotnet

    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "alacritty"
    cask "firefox-developer-edition"
    cask "raycast"
    cask "rectangle"

    # Fonts
    cask "font-fira-code-nerd-font"
    cask "font-hack-nerd-font"

    # Dotnet
    cask "dotnet-sdk6-0-200"

elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ical-buddy" # output calendar events in terminal
brew "bat" # better cat
brew "git" # Git version control (latest version)
brew "grep" # grep (latest)
brew "neovim" # A better vim
brew "python" # python (latst)
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "wget" # internet file retriever
brew "fnm" # Fast Node version manager
brew "jq" # Json formatter
brew "curl" # Later curl version

# Zsh and plugins
brew "zsh" # zsh (latest)
brew "zsh-syntax-highlighting" # Syntax highlighting for terminal
brew "zsh-autosuggestions" # Auto suggest for terminal
brew "pure" # Prompt to be used

# Neo-vim
brew "ripgrep" # Used for telescope fuzzy finder
brew "stylua" # Formatter for lua
