if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-versions"
    tap "homebrew/cask-fonts"
    tap "isen-ng/dotnet-sdk-versions" # For dotnet

    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "alacritty"
    cask "firefox-developer-edition"

    # Fonts
    cask "font-fira-code-nerd-font"
    cask "font-hack-nerd-font"

    # Dotnet
    cask "dotnet-sdk6-0-200"

    # Window manager
    brew "koekeishiya/formulae/skhd"
    brew "koekeishiya/formulae/yabai"

    # Docker
    cask "docker" 

elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ical-buddy" # output calendar events in terminal
brew "bat" # better cat
brew "git" # Git version control (latest version)
brew "grep" # grep (latest)
brew "neovim" # A better vim
brew "python" # python (latst)
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "wget" # internet file retriever
brew "fnm" # Fast Node version manager
brew "jq" # Json formatter
brew "curl" # Later curl version
brew "fzf" # Commandline fuzzy finder
brew "awscli"

# Go
brew "golang" # Go language and dev env
brew "gopls" # Language server for go


# Lua
brew "lua-language-server" # Language server for lua

# Rust
brew "rustup" # Rust language and dev env
brew "rust-analyzer" # Language server for rust
tap "cargo-lambda/cargo-lambda"
brew "cargo-lambda"

# Zsh and plugins
brew "zsh" # zsh (latest)
brew "zsh-syntax-highlighting" # Syntax highlighting for terminal
brew "zsh-autosuggestions" # Auto suggest for terminal
brew "pure" # Prompt to be used

# Neo-vim
brew "ripgrep" # Used for telescope fuzzy finder
brew "stylua" # Formatter for lua



brew "ansible"
